run/tutorial1_noRadiation/constant/solid/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermal
{
    type                    multiMaterialZones;

    laws
    (
        material0
        {
            type            constant;
            rho             rho [1 -3 0 0 0] 10;
            C               C [0 2 -2 -1 0] 100;
            k               k [1 1 -3 -1  0] 10;

            zones           ( solidBlock );
        }
    );

    gaps
    (
        air // gap 0
        {
            type            constant;
            beta            beta [1 1 -3 -1  0] 1;
            zones           ( contactSurface );
        }
    );

    sources
    (
    );
}

// ************************************************************************* //
